content/euler/40.md
+++
title = "Project Euler 40: Champernowne's Constant"
author = ["Gautam Manohar"]
description = "My solution to problem 40 of Project Euler."
date = 2018-06-24
tags = ["fun", "implementation"]
categories = ["euler"]
draft = false
+++

## Problem Statement {#problem-statement}

An irrational decimal is created by concatenating the positive integers:

\begin{equation\*}
0.12345678910\mathbf{1}112131415161718192021\ldots
\end{equation\*}

It can be seen that the 12th digit of the fractional part is `1`. If \\(d\_n\\)
represents the $n$-th digit of the fractional part, then given integers \\(i\_j\\),
find the product of \\(d\_{i\_j}\\).


## My Algorithm {#my-algorithm}

We can split up the fractional part into "blocks" where each positive integer
used has the same number of digits. For example, starting at zero, the zeroth
block is `123456789`, the first `101112...9899`, and so on. The numbers used to make
up the $n$-th block (where the first block is \\(n = 0\\)) range from \\(10^n\\) to
\\(10^{n+1} - 1\\), inclusive. There are therefore \\(10^{n+1} - 10^n = 9\cdot10^n\\)
numbers in the $n$-th block. Because each number in the $n$-th block has \\(n+1\\)
digits, the $n$-th block is \\(9(n+1)10^n\\) digits long. We initialize `block` at 1.
This means `block` is equal to \\(n+1\\). It represents the number of digits in each
integer in the block that \\(d\_i\\) is part of. We initialize `fact` at 9. It
represents the number of positive integers that make up `block`. This means
`fact*block` represents the length of `block`. Then, as long as the result is
positive and `fact / block` is less than \\(9M\\), where \\(M\\) is the maximum possible
value of \\(i\\) in \\(d\_i\\) (a hard upper bound on the length of the largest block,
given the input constraints), we subtract `fact/block` from the given \\(d\_i\\).
Then, we multiply `fact` by 10, representing the ten-fold increase in the number
of elements of the next block, and increment `block` by 1, representing the fact
that we are moving to the next block. The resulting value of `block` is the block
in which \\(d\_i\\) is located. The resulting value of \\(d\_i\\) is `pos+1`, where `pos`
is the zero-indexed "position" of \\(d\_i\\) in its block; that is, \\(d\_i\\) is the
`pos`-th digit in its block. Because \\(d\_i\\) is in the block given by `block`, the
first number in its block is `10//(block-1)`. Each number in this block has `block`
digits. And so `pos//block` gives the number of positive integers that precede the
integer \\(d\_i\\) is part of in its block. This means \\(d\_i\\) is part of the positive
integer `10//(block-1) + pos//block` The leftover after this division (that is,
`pos % block`) is the index (starting at 0) of \\(d\_i\\) in the number it is part of.
Because we know the number that \\(d\_i\\) is part of, we have solved the problem.
Using our general procedure, we find \\(d\_{i\_{j}}\\) and calculate their product.
The most intensive part of our solution is finding the block that \\(d\_i\\) is part
of; finding the value of \\(d\_i\\) after this is just an \\(O(1)\\) string operation.
The lengths of the blocks form an arithmetogeometric sequence, so there are
\\(O(\log n)\\) blocks (not a tight upper bound). And so our solution has time
complexity \\(O(D\log i\_{j\_{\text{max}}})\\), where \\(D\\) is the number of digits to
find.